docs/setup_environ.tex
% Created 2022-05-15 Sun 23:29
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[latin1]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[x11names]{xcolor}
\hypersetup{linktoc = all, colorlinks = true, urlcolor = blue, citecolor = green, linkcolor = black}
\author{Yantao Xia}
\date{\textit{<2022-05-15 Sun>}}
\title{}
\hypersetup{
 pdfauthor={Yantao Xia},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

This file is intended to help with setting up the development environment for BJMU's cell image analysis project. Things change rapidly but we attempt to keep instructions here up to date. 

\section{Toolchain overview}
\label{sec:orgf7213ea}
the toolchain consists of MATLAB, ImageJ, cellpose, trackmate. These tools are written in different languages but we can make them cooperate with each other easily. 
\begin{itemize}
\item MATLAB: you know what it is already. what you may not know is that MATLAB comes with JVM, and the entire Java API is exposed to the MATLAB command line.
\item ImageJ: A image processing package based on SciJava, in turn based on Java. This is basically the Java `equivalent' of numpy.
\item cellpose: A segmentation method, using pytorch as the machine learning framework. Pytorch is python wrapper around torch, a library in CUDA and C++.
\item TrackMate: An ImageJ plug in written using SciJava's capabilities.
\end{itemize}
\textbf{Note}: to exploit GPU hardware acceleration, you need a GPU from NVIDIA. If you do not have that, CUDA will not work as it is proprietary library. Given NVIDIA's dominance over the GPU market, it is likely you have one as long as you have a dedicated graphics card. 

The software stack we are going to adopt is as follows:
\begin{enumerate}
\item We will use MATLAB as a rapid protyping language. It will be used to control ImageJ. The details are given here: \href{https://imagej.net/scripting/matlab}{MATLAB Scripting in ImageJ2}. Example specific to TrackMate is available here: \href{https://imagej.net/plugins/trackmate/using-from-matlab}{Using TrackMate from MATLAB}
\item ImageJ will be used to launch cellpose and TrackMate, since there already exists an interface between the two. See documentation here: \href{https://imagej.net/plugins/trackmate/trackmate-cellpose}{TrackMate-Cellpose}
\item The final product can be a MATLAB program, instead of python. Reason: 1) this is the method we are most familiar with, and 2) it will not introduce much overhead since installing the ImageJ and cellpose will take up space on the order of gigabytes already, excluding the MATLAB runtime.
\end{enumerate}

The overall flow of information: 
\begin{enumerate}
\item Run cellpose to segment image.
\item Save segmented mask to disk.
\item Use TrackMate to match the cells from across images.
\item Save the tracks to disk.
\item Read tracks and masks in MATLAB, and analyze the intensities
\end{enumerate}
\textbf{Note}: During protyping phase, these components can be decoupled:

\section{Installation}
\label{sec:orgb2c228a}
\begin{itemize}
\item MATLAB: you already have it.
\item ImageJ: Simply \href{https://imagej.net/software/fiji/}{download Fiji}.
\item cellpose: install via conda. 
\begin{enumerate}
\item install conda. \emph{A \href{https://docs.conda.io/en/latest/miniconda.html}{miniconda} installation is preferred, do \textbf{NOT} install anything in the base environment}
\item change the mirror to \href{https://mirrors.tuna.tsinghua.edu.cn/help/anaconda/}{tuna}. Do it for both conda and conda-forge channels.
\item \texttt{conda create -n cellpose}
\item \texttt{conda install pytorch cudatoolkit=11.3 -c pytorch}. \textbf{Note}: depending on your GPU, you might need to change the pytorch and CUDA version, see instructions \href{https://github.com/MouseLand/cellpose/issues/481\#issuecomment-1080137885}{here}.
\item \texttt{conda install -c conda-forge cellpose}
\item launch cellpose. Most likely it will complain about missing packages. Install any missing dependencies as listed in \href{https://cellpose.readthedocs.io/en/latest/installation.html}{their docs}.
\item Verify it is using GPU. It should say so in console output.
\end{enumerate}
\item TrackMate: the plugin comes pre-installed with the Fuji distribution of ImageJ.
\item trackmate-cellpose: this interface is not preinstalled. \href{https://imagej.net/plugins/trackmate/trackmate-cellpose}{Instructions here}.
\end{itemize}
\textbf{Note}: the trackmate-cellpose plugin is not aware of DLLs (\emph{e.g.} numpy) unless they are explicitly included in the path. You can add the conda paths to the Windows \texttt{\%PATH\%} but this will pollute environment and cause problems later on. A better way is to set the path on the fly using a batch script: 
\begin{verbatim}
SET PATH=^
D:\Miniconda\envs\ast240\Library\mingw-w64\bin;^
D:\Miniconda\envs\ast240\Library\bin;^
D:\Miniconda\envs\ast240\Scripts;^
D:\Miniconda\envs\ast240;%PATH% ^
&& START /D ^"D:\Program Files\fiji-win64\Fiji.app^" ImageJ-win64.exe
\end{verbatim}
save this somewhere as \texttt{.bat} file, edit the paths accordingly.
\end{document}